app/controllers/cart_controller.rb

  def create
    new_cart_item = Cart.new(cart_params)
    new_cart_item.user_id = current_user.id

    if new_cart_item.save
      cart_items = Cart.where(user_id: current_user.id)
---
INSERT INTO "carts" ("game_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["game_id", "9jsd9fsdfgggggggggggg"], ["created_at", "2022-08-31 03:41:01.416527"], ["updated_at", "2022-08-31 03:41:01.416527"], ["user_id", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ?  [["user_id", 1]]

  def destroy
    if @cart_item.destroy
---
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 1]]

  def set_cart_item
    @cart_item = Cart.find(params[:id])
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]