app/controllers/favourites_controller.rb

SELECT "favourites".* FROM "favourites" WHERE "favourites"."user_id" = ?  [["user_id", 1]]
---
    def show_all
        favourites = Favourite.where(user_id: @current_user.id)

INSERT INTO "favourites" ("game_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["game_id", "9jsd9fsdfgggggggggggg"], ["created_at", "2022-08-31 03:40:11.077870"], ["updated_at", "2022-08-31 03:40:11.077870"], ["user_id", 1]]
---
    def create
        new_favourite = Favourite.new(favourite_params)
        new_favourite.user_id = @current_user.id

        if new_favourite.save

DELETE FROM "favourites" WHERE "favourites"."id" = ?  [["id", 1]]
---
    def destroy
        if @favourite.destroy

SELECT "favourites".* FROM "favourites" WHERE "favourites"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_favourites
      @favourite = Favourite.find(params[:id])