app/controllers/game_purchase_controller.rb

SELECT "game_purchases".* FROM "game_purchases" WHERE "game_purchases"."user_id" = ?  [["user_id", 1]]
---
    def show_all
        purchases = GamePurchase.where(user_id: current_user.id)

INSERT INTO "game_purchases" ("game_id", "discount", "total", "status", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["game_id", "1234"], ["discount", 0], ["total", 1234.0], ["status", 0], ["created_at", "2022-08-31 06:57:22.314262"], ["updated_at", "2022-08-31 06:57:22.314262"], ["user_id", 1]]
---
    def create
        purchase = GamePurchase.new(purchase_params)
        purchase.user_id = current_user.id

        if purchase.save

DELETE FROM "game_purchases" WHERE "game_purchases"."id" = ?  [["id", 1]]
---
    def destroy
        if @purchase.destroy

SELECT "game_purchases".* FROM "game_purchases" WHERE "game_purchases"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def get_game_purchase
        @purchase = GamePurchase.find(params[:id])